# FabricAreaType Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricArea..::..FabricAreaType Property
FabricArea Class See Also
---
The type of the Fabric Area.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FabricAreaType FabricAreaType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FabricAreaType As FabricAreaType
	Get
```

Visual C++
---
```text
public:
property FabricAreaType^ FabricAreaType {
	FabricAreaType^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace